TestingTool_3-0/src/InformationRegisters/Планировщик/Планировщик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Планировщик</name>
  <resources>
    <name>Включено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПовтораПриОшибке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторовПриОшибке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПродолжатьПриОшибке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Понедельник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Вторник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Среда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Четверг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Пятница</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Суббота</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Воскресенье</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончанияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапускаСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершенияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Однократно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>CatalogRef.Задания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Интервал</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/Планировщик/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// сформируем данные в млс
	Для каждого стр из ЭтотОбъект Цикл
		стр.ИнтервалСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.Интервал);
		стр.ВремяНачалаСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ВремяНачала);
		стр.ВремяОкончанияСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ВремяОкончания);
		стр.ДатаЗапускаСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ДатаЗапуска);
		стр.ДатаЗавершенияСек = ПланировщикЗаданийКлиентСервер.ПреобразоватьДатуВСек(стр.ДатаЗавершения);
	КонецЦикла;	

КонецПроцедуры

#КонецЕсли
